IDENTIFICATION DIVISION.
PROGRAM-ID. EJERCICIO1.

DATA DIVISION.
WORKING-STORAGE SECTION.

    01 WSC-CONSTANTES.
        05 WSC-EDAD-MINIMA PIC 99 VALUE 18.
        05 WSC-ESTADO-SECUNDARIA PIC X VALUE 'T'.
        05 WSC-ESTADO-CARRERA-OK.
            10 WSC-TERMINADO PIC X VALUE 'T'.
            10 WSC-ENCURSO PIC X VALUE 'C'. 
            
     01 WSC-VARIABLES.
        05 WS-POSTULANTES.
            10 WSV-POST1.
                15 MSV-NOMBRE1 PIC X(5) VALUE 'PEDRO'.
                15 MSV-EDAD PIC 99 VALUE 15.
                15 MSV-SECUNDARIA PIC X VALUE 'N'.
                15 MSV-CARRERA PIC X VALUE 'N'.
            10 WSV-POST2.
                15 MSV-NOMBRE1 PIC X(5) VALUE 'SOFIA'.
                15 MSV-EDAD PIC 99 VALUE 25.
                15 MSV-SECUNDARIA PIC X VALUE 'T'.
                15 MSV-CARRERA PIC X VALUE 'T'.
            10 WSV-POST3.
                15 MSV-NOMBRE1 PIC X(5) VALUE 'LALA'.
                15 MSV-EDAD PIC 99 VALUE 19.
                15 MSV-SECUNDARIA PIC X VALUE 'T'.
                15 MSV-CARRERA PIC X VALUE 'N'.
        05 WSV-POST-AUX.       
                10 MSV-NOMBRE-AUX PIC X(5).
                10 MSV-EDAD-AUX PIC 99.
                10 MSV-SECUNDARIA-AUX PIC X.
                10 MSV-CARRERA-AUX PIC X.    
                
                
         05 WSV-INDICE PIC 99 VALUE 1.
            
    PROCEDURE DIVISION.
    00-CONTROL.
    DISPLAY 'NUEVOS TRABAJADORES IT 2025 - CAIXA ONINYENT'.
    DISPLAY '---------------------------------------------'.
    
 
    PERFORM 10-EVALUAR-POST VARYING WSV-INDICE FROM 1 BY 1 UNTIL WSV-INDICE > 3.

    
STOP RUN.
00-CONTROL-END.
EXIT.


10-EVALUAR-POST.

    EVALUATE WSV-INDICE
        WHEN 1
            MOVE WSV-POST1 TO WSV-POST-AUX
        WHEN 2
            MOVE WSV-POST2 TO WSV-POST-AUX
        WHEN 3
            MOVE WSV-POST3 TO WSV-POST-AUX
        WHEN OTHER
            DISPLAY 'Fuera de rango'
    END-EVALUATE.

    PERFORM 20-EVALUAR.



20-EVALUAR.

    IF(MSV-NOMBRE-AUX >= WSC-EDAD-MINIMA AND MSV-SECUNDARIA-AUX EQUAL WSC-ESTADO-SECUNDARIA AND (MSV-CARRERA-AUX EQUAL WSC-TERMINADO OR WSC-ENCURSO))
        DISPLAY MSV-NOMBRE-AUX ' CUMPLE CON LOS REQUISITOS'
    ELSE
         DISPLAY MSV-NOMBRE-AUX ' NO CUMPLE CON LOS REQUISITOS'
    END-IF.

20-EVALUAR-END.
EXIT.
            
            
    
